app/controllers/coordinador_controller.rb

SELECT  "mensajes".* FROM "mensajes" WHERE "mensajes"."coordinador_id" = ? LIMIT ?  [["coordinador_id", 1], ["LIMIT", 1]]
---
  def showMessage
  	@mensaje = Mensaje.where(coordinador_id: params[:id])

INSERT INTO "mensajes" ("coordinador_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["coordinador_id", 1], ["created_at", "2017-12-18 15:19:08.522101"], ["updated_at", "2017-12-18 15:19:08.522101"]]
---
  def createMessage
    mensajeNuevo = Mensaje.new
    logger.info(mensaje_params)
    mensajeNuevo.titulo = mensaje_params[:titulo]
    mensajeNuevo.texto = mensaje_params[:texto]
    mensajeNuevo.carrera = mensaje_params[:carrera]
    mensajeNuevo.campus = mensaje_params[:campus]
    mensajeNuevo.coordinador_id = params[:id]

    if mensaje_params[:imageDIR]
      mensajeNuevo.imageDIR = mensaje_params[:imageDIR]
    end

    if mensajeNuevo.save

SELECT  "coordinadors".* FROM "coordinadors" WHERE "coordinadors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_coord
    @coordinador = Coordinador.find(params[:id])