app/controllers/tutorado_controller.rb

SELECT "tutorados".* FROM "tutorados"
---
  def index
    @tutorados = Tutorado.all

SELECT  "tutorados".* FROM "tutorados" WHERE "tutorados"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_tutorado
      @tutorado = Tutorado.find(params[:id])