app/controllers/tutor_controller.rb

SELECT "mensajes".* FROM "mensajes" WHERE "mensajes"."carrera" = ?  [["carrera", "Ing. Ejec. en Informatica"]]
---
  def showMessage
  	@mensaje = Mensaje.where(carrera: @tutor.carrera)

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."email" = ? LIMIT ?  [["email", "jcordova@alumnos.usm.cl"], ["LIMIT", 1]]
SELECT  "coordinadors".* FROM "coordinadors" WHERE "coordinadors"."email" = ? LIMIT ?  [["email", "antonio.salinas@usm.cl"], ["LIMIT", 1]]
---
  def login
  	logger.info(params[:email])
  	key = "Tutor"
  	@usuario = Tutor.find_by(email: params[:email])
  	if @usuario
      email = params[:email]
      pass = params[:contraseña]
      @usuario.contraseña = AESCrypt.decrypt(@usuario.contraseña, key)
      if email==@usuario.email && pass == @usuario.contraseña
        @usuario.contraseña = AESCrypt.encrypt(@usuario.contraseña, key)

        tutor = {:id => @usuario.id,:isCoord => false}

        render json: tutor, status: :ok
      else
        error = {:code => "Password Incorrecto"}
        render json: error, status: :unprocessable_entity
        #render json: @usuario.errors, status: :unprocessable_entity
      end
    else
	    @usuario = Coordinador.find_by(email: params[:email])

INSERT INTO "tutor_tutorado_semestres" ("semestre", "tutorado_id", "tutor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["semestre", "2017-2"], ["tutorado_id", 1], ["tutor_id", 1], ["created_at", "2017-12-17 21:35:10.885072"], ["updated_at", "2017-12-17 21:35:10.885072"]]
---
  def assign
   @asignar = TutorTutoradoSemestre.new
   @asignar.semestre = "2017-2"
   @asignar.tutor_id = params[:id]
   @asignar.tutorado_id = tutorado_params[:tutorado_id]

   if @asignar.save

SELECT "tutor_tutorado_semestres".* FROM "tutor_tutorado_semestres" WHERE "tutor_tutorado_semestres"."tutor_id" = ?  [["tutor_id", 1]]
---
  def show_tutorado_assing
    @asignados = TutorTutoradoSemestre.where(tutor_id: params[:id])

SELECT COUNT(*) FROM "entrevista" WHERE "entrevista"."tutor_id" = ?  [["tutor_id", 1]]
---
  def interview
    entrevista = Entrevista.new

    entrevista.tutor_id = params[:id]
    entrevista.tutorado_id = entrevista_params[:tutorado_id]
    entrevista.comentario = entrevista_params[:comentario]

    totalEntrevista = Entrevista.where(tutor_id: params[:id]).count

INSERT INTO "entrevista" ("comentario", "vocacional", "academico", "interracion", "migratorio", "salud", "familiar", "economico", "cantidadEntrevista", "tutorado_id", "tutor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
      entrevista.economico = 0
    end

    if entrevista.save

SELECT "entrevista".* FROM "entrevista" WHERE "entrevista"."tutor_id" = ?  [["tutor_id", 1]]
---
  def show_interview
    @entrevistados = Entrevista.where(tutor_id: params[:id])

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_tutor
    @tutor = Tutor.find(params[:id])